Ran Plan for 11 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
1. project: `backend_amer_autoscale` dir: `backend/gcp_autoscale` workspace: `amer`
1. project: `backend_asia_autoscale` dir: `backend/gcp_autoscale` workspace: `asia`
1. project: `backend_ocea_autoscale` dir: `backend/gcp_autoscale` workspace: `ocea`
1. project: `backend_euro_autoscale` dir: `backend/gcp_autoscale` workspace: `euro`
1. project: `cassandra_amer_nodes` dir: `cassandra/gcp_nodes` workspace: `amer`
1. project: `cassandra_euro_nodes` dir: `cassandra/gcp_nodes` workspace: `euro`
1. project: `cassandra_asia_nodes` dir: `cassandra/gcp_nodes` workspace: `asia`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.asg[1] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-east4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-amer-us-west4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-west4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 3
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-amer-us-east4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-east4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 3
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "frontend-svc-amer-us-west4"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_backend_service.asg[1] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "frontend-svc-amer-us-east4"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_forwarding_rule.asg[0] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "frontend-forwarding-rule-us-west4"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "us-west4"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_forwarding_rule.asg[1] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "frontend-forwarding-rule-us-east4"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "us-east4"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.asg[0] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-us-west4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_http_health_check.asg[1] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-us-east4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-amer-us-west40"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "frontend-group-manager-amer-us-west4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-west4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_group_manager.asg[1] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-amer-us-east41"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "frontend-group-manager-amer-us-east4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-east4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_template.asg will be created
+ resource "google_compute_instance_template" "asg" {
      + can_ip_forward          = false
      + id                      = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + name                    = (known after apply)
      + name_prefix             = (known after apply)
      + project                 = (known after apply)
      + region                  = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)

      + disk {
          + auto_delete  = true
          + boot         = (known after apply)
          + device_name  = (known after apply)
          + disk_type    = (known after apply)
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "debian-cloud/debian-9"
          + type         = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-us-west4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "frontend-target-pool-us-west4"
      + project          = (known after apply)
      + region           = "us-west4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_compute_target_pool.asg[1] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-us-east4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "frontend-target-pool-us-east4"
      + project          = (known after apply)
      + region           = "us-east4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.us-west4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg[1] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.us-east4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # random_id.instance_id will be created
+ resource "random_id" "instance_id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-336a6421"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-west6"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.asg[1] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-336a6421"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-north1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-euro-europe-west6"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "europe-west6-a"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 3
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-euro-europe-north1"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "europe-north1-a"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 3
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "frontend-svc-euro-europe-west6"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_backend_service.asg[1] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "frontend-svc-euro-europe-north1"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_forwarding_rule.asg[0] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "frontend-forwarding-rule-europe-west6"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "europe-west6"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_forwarding_rule.asg[1] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "frontend-forwarding-rule-europe-north1"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "europe-north1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.asg[0] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-europe-west6"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_http_health_check.asg[1] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-europe-north1"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-euro-europe-west60"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "frontend-group-manager-euro-europe-west6"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "europe-west6-a"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923060240395100000001"
        }
    }

  # google_compute_instance_group_manager.asg[1] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-euro-europe-north11"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "frontend-group-manager-euro-europe-north1"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "europe-north1-a"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923060240395100000001"
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-europe-west6",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "frontend-target-pool-europe-west6"
      + project          = (known after apply)
      + region           = "europe-west6"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_compute_target_pool.asg[1] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-europe-north1",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "frontend-target-pool-europe-north1"
      + project          = (known after apply)
      + region           = "europe-north1"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.europe-west6.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg[1] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.europe-north1.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`
</details>

---
### 5. project: `backend_amer_autoscale` dir: `backend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "backend-autoscale-3e49db60"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.asg[1] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "backend-autoscale-3e49db60"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-east4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-backend-amer-us-west4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-west4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 1
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.7
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-backend-amer-us-east4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-east4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 1
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.7
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "backend-amer-us-west4"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_backend_service.asg[1] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "backend-amer-us-east4"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_http_health_check.asg[0] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "backend-health-check-us-west4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_http_health_check.asg[1] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "backend-health-check-us-east4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "backend-asg-amer-us-west40"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "backend-group-manager-amer-us-west4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-west4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923053201906300000001"
        }
    }

  # google_compute_instance_group_manager.asg[1] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "backend-asg-amer-us-east41"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "backend-group-manager-amer-us-east4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-east4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923053201906300000001"
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "backend-health-check-us-west4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "backend-target-pool-us-west4"
      + project          = (known after apply)
      + region           = "us-west4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_compute_target_pool.asg[1] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "backend-health-check-us-east4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "backend-target-pool-us-east4"
      + project          = (known after apply)
      + region           = "us-east4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "backend-asg.us-west4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg[1] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "backend-asg.us-east4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p backend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fbackend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p backend_amer_autoscale`
</details>

---
### 6. project: `backend_asia_autoscale` dir: `backend/gcp_autoscale` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p backend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fbackend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p backend_asia_autoscale`

---
### 7. project: `backend_ocea_autoscale` dir: `backend/gcp_autoscale` workspace: `ocea`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p backend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fbackend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p backend_ocea_autoscale`

---
### 8. project: `backend_euro_autoscale` dir: `backend/gcp_autoscale` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "backend-autoscale-b652493e"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-west6"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.asg[1] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "backend-autoscale-b652493e"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "europe-north1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-backend-euro-europe-west6"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "europe-west6-a"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 1
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.7
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-backend-euro-europe-north1"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "europe-north1-a"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 1
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.7
            }
        }
    }

  # google_compute_backend_service.asg[0] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "backend-euro-europe-west6"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_backend_service.asg[1] will be created
+ resource "google_compute_backend_service" "asg" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "backend-euro-europe-north1"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = (known after apply)
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_http_health_check.asg[0] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "backend-health-check-europe-west6"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_http_health_check.asg[1] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "backend-health-check-europe-north1"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "backend-asg-euro-europe-west60"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "backend-group-manager-euro-europe-west6"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "europe-west6-a"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923062846700500000001"
        }
    }

  # google_compute_instance_group_manager.asg[1] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "backend-asg-euro-europe-north11"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "backend-group-manager-euro-europe-north1"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "europe-north1-a"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200923062846700500000001"
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "backend-health-check-europe-west6",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "backend-target-pool-europe-west6"
      + project          = (known after apply)
      + region           = "europe-west6"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_compute_target_pool.asg[1] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "backend-health-check-europe-north1",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "backend-target-pool-europe-north1"
      + project          = (known after apply)
      + region           = "europe-north1"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "backend-asg.europe-west6.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg[1] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "backend-asg.europe-north1.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p backend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fbackend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p backend_euro_autoscale`
</details>

---
### 9. project: `cassandra_amer_nodes` dir: `cassandra/gcp_nodes` workspace: `amer`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/dmalicia/dm-terraform/41/amer/cassandra/gcp_nodes/cassandra_amer_nodes-amer.tfplan\"" in "/home/atlantis/.atlantis/repos/dmalicia/dm-terraform/41/amer/cassandra/gcp_nodes": exit status 1
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_id.instance_id: Refreshing state... [id=153HxcCsd3E]
data.google_secret_manager_secret_version.basic: Refreshing state... [id=projects/2036174436/secrets/creds/versions/2]

Error: Invalid index

  on main.tf line 21, in resource "google_compute_address" "static":
  21:   region = var.regions[terraform.workspace][count.index]
    |----------------
    | count.index is 2
    | terraform.workspace is "amer"
    | var.regions is map of tuple with 3 elements

The given key does not identify an element in this collection value.


```
</details>

---
### 10. project: `cassandra_euro_nodes` dir: `cassandra/gcp_nodes` workspace: `euro`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/dmalicia/dm-terraform/41/euro/cassandra/gcp_nodes/cassandra_euro_nodes-euro.tfplan\"" in "/home/atlantis/.atlantis/repos/dmalicia/dm-terraform/41/euro/cassandra/gcp_nodes": exit status 1
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.google_secret_manager_secret_version.basic: Refreshing state... [id=projects/2036174436/secrets/creds/versions/2]
random_id.instance_id: Refreshing state... [id=4B1rw95y2Ck]

Error: Invalid index

  on main.tf line 21, in resource "google_compute_address" "static":
  21:   region = var.regions[terraform.workspace][count.index]
    |----------------
    | count.index is 2
    | terraform.workspace is "euro"
    | var.regions is map of tuple with 3 elements

The given key does not identify an element in this collection value.


```
</details>

---
### 11. project: `cassandra_asia_nodes` dir: `cassandra/gcp_nodes` workspace: `asia`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p cassandra_asia_nodes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Fcassandra%252Fgcp_nodes%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p cassandra_asia_nodes`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
